apps/backend/artillery-load-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Ramp up load"
    - duration: 60
      arrivalRate: 100
      name: "Sustained load"
  defaults:
    headers:
      Content-Type: 'application/json'

scenarios:
  - name: "Health Check"
    flow:
      - get:
          url: '/api/health'
          expect:
            - statusCode: 200

  - name: "Database Connection Check"
    flow:
      - get:
          url: '/api/health/connections'
          expect:
            - statusCode: 200

  - name: "Concurrent Request Test"
    flow:
      - get:
          url: '/api/health'
          expect:
            - statusCode: 200
      - think: 1  # Think time between requests